# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 17,31, 59,119]  # P4/16
  - [116,90, 156,198, 60,110]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, PhiNet, [160, [5,7,-1], 0.35,  7, 1, False, True]],  # 0-1-2
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]], 
   [-1, 3, C3, [256, False]],  # 6

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],
   [-1, 3, C3, [128, False]],  # 10

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],  # 13

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 16

   [[10, 13, 16], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]