# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 1.  # scales convolution channels
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 17,31, 59,119]  # P4/16
  - [116,90, 156,198, 60,110]  # P5/32

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [24, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [24, True]]
  - [-1, 1, Conv, [32, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [32, True]]
  - [-1, 1, Conv, [48, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [48, True]]
  - [-1, 1, Conv, [56, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [56, True]]
  - [-1, 1, SPPF, [56, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [64]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [64]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [64]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [64]]  # 23 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc, anchors]]  # Detect(P3, P4, P5)
