# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [3,6, 5,13, 7,18]  # P3/8
  - [10,25, 14,33, 17,47]  # P4/16
  - [30,54, 24,70, 40,85]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [24, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [24]],
   [-1, 1, Conv, [32, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [32]],
   [-1, 1, Conv, [32, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [32]],
   [-1, 1, Conv, [64, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [64]],
   [-1, 1, SPPF, [64, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [64, False]],  # 13

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [64, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [64, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [64, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
